QuantumLeaps/qpcpp-examples/arm-cm/dpp_ek-tm4c123gxl_mpu/qk/bsp.cpp
// Shared Event-pools.........................................................
constexpr std::uint32_t EPOOLS_SIZE_POW2 {8U};

__attribute__((aligned((1U << EPOOLS_SIZE_POW2))))
static struct EPools {
    QF_MPOOL_EL(APP::TableEvt) smlPool[2*APP::N_PHILO];
    // ... other pools
} EPools_sto;
static_assert(sizeof(EPools_sto) <= (1U << EPOOLS_SIZE_POW2),
              "Insufficient storage for Event Pools");

} // unnamed namespace

// Idle thread ............................................................
#ifdef Q_SPY

// size of QS-RX buffer, as power-of-2
#define QS_RX_BUF_SIZE_POW2 ((uint32_t)7U)
__attribute__((aligned((1U << QS_RX_BUF_SIZE_POW2))))
std::uint8_t QS_rxBuf[1U << QS_RX_BUF_SIZE_POW2];

#ifdef QF_MEM_ISOLATE
// Idle thread owns QS-RX, so it needs access to its data...

// size of QS_rxPriv_, as power-of-2
#define QS_RX_PRIV_SIZE_POW2 ((uint32_t)7U)
namespace QP {
namespace QS {
__attribute__((aligned((1U << QS_RX_PRIV_SIZE_POW2))))
RxAttr rxPriv_;

static_assert(sizeof(rxPriv_) <= (1U << QS_RX_PRIV_SIZE_POW2),
              "Insufficient storage for QS-RX data");
} // namespace QS
} // namespace QP

namespace { // unnamed namespace

static MPU_Region const MPU_Idle[3] = {
    { reinterpret_cast<std::uint32_t>(&QP::QS::rxPriv_) + 0x10U, //---- region #0
      ((QS_RX_PRIV_SIZE_POW2 - 1U) << MPU_RASR_SIZE_Pos)  // size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (1U << MPU_RASR_C_Pos)                       // C=1
       + (0U << MPU_RASR_B_Pos)                       // B=0
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk },                       // region enable
    { reinterpret_cast<std::uint32_t>(&QS_rxBuf) + 0x11U, //---- region #1
      ((QS_RX_BUF_SIZE_POW2 - 1U) << MPU_RASR_SIZE_Pos)  // size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (1U << MPU_RASR_C_Pos)                       // C=1
       + (0U << MPU_RASR_B_Pos)                       // B=0
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk },                       // region enable
    { 0U + 0x12U,                              //---- region #2
      0U },
};

} // unnamed namespace

#endif // QF_MEM_ISOLATE

#else // Q_SPY not defined

#ifdef QF_MEM_ISOLATE

namespace { // unnamed namespace

static MPU_Region const MPU_Idle[3] = {
    { 0U + 0x10U,                              //---- region #0
      0U },
    { 0U + 0x11U,                              //---- region #1
      0U },
    { 0U + 0x12U,                              //---- region #2
      0U },
};

} // unnamed namespace

#endif // QF_MEM_ISOLATE

#endif // Q_SPY not defined

//============================================================================
#ifdef QF_MEM_ISOLATE

extern "C" {

//............................................................................
__attribute__(( used ))
void QF_onMemSys(void) {
    uint32_t const mpu_ctrl = MPU->CTRL;  // save the previous MPU CTRL
    // no nesting of memory protection
    Q_REQUIRE_INCRIT(400, (mpu_ctrl & MPU_CTRL_PRIVDEFENA_Msk) == 0U);

    MPU->CTRL = MPU_CTRL_ENABLE_Msk        // enable the MPU
                | MPU_CTRL_PRIVDEFENA_Msk; // enable background region
    __ISB();
    __DSB();
}
//............................................................................
__attribute__(( used ))
void QF_onMemApp() {
    uint32_t const mpu_ctrl = MPU->CTRL;  // save the previous MPU CTRL
    // no nesting of memory protection
    Q_REQUIRE_INCRIT(500, (mpu_ctrl & MPU_CTRL_PRIVDEFENA_Msk) != 0U);

    MPU->CTRL = MPU_CTRL_ENABLE_Msk; // enable the MPU
                // but do NOT enable background region
    __ISB();
    __DSB();
}
//............................................................................
// NOTE: the context-switch callback is called with interrupts DISABLED
void QF_onContextSw(QP::QActive *prev, QP::QActive *next) {
    MPU_Region const * const region =
        (next != nullptr)
        ? static_cast<MPU_Region const *>(next->getThread())
        : MPU_Idle;

    MPU->CTRL = 0U; // disable the MPU

    MPU->RBAR = region[0].RBAR;
    MPU->RASR = region[0].RASR;
    MPU->RBAR = region[1].RBAR;
    MPU->RASR = region[1].RASR;
    MPU->RBAR = region[2].RBAR;
    MPU->RASR = region[2].RASR;

    MPU->CTRL = MPU_CTRL_ENABLE_Msk        // enable the MPU (Sys privilege)
                | MPU_CTRL_PRIVDEFENA_Msk; // enable background region
    __ISB();
    __DSB();
}

} // extern "C"

//============================================================================
namespace { // unnamed namespace

//............................................................................
static void TM4C123GXL_MPU_setup() {

    SCB->SHCSR |= SCB_SHCSR_MEMFAULTENA_Msk;

    MPU->CTRL = 0U; // disable the MPU

    // region #7: NULL-pointer protection region
    MPU->RBAR = 0x00000000U + 0x17U;        // base address + region #7
    MPU->RASR = ((8U - 1U) << MPU_RASR_SIZE_Pos) // 2^8=256B size
       + (0U << MPU_RASR_AP_Pos)                      // PA:na/UA:na
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (0U << MPU_RASR_S_Pos)                       // S=0
       + (0U << MPU_RASR_C_Pos)                       // C=0
       + (0U << MPU_RASR_B_Pos)                       // B=0
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk;                         // region enable

    // region #6: stack region
    MPU->RBAR = 0x20000000U + 0x16U;        // base address + region #6
    MPU->RASR = ((STACK_SIZE_POW2 - 1U) << MPU_RASR_SIZE_Pos)  // size
       + (3U << MPU_RASR_AP_Pos)                      // PA:rw/UA:rw
       + (1U << MPU_RASR_XN_Pos)                      // XN=1
       + (1U << MPU_RASR_S_Pos)                       // S=1
       + (1U << MPU_RASR_C_Pos)                       // C=1
       + (0U << MPU_RASR_B_Pos)                       // B=0
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk;                         // region enable

    // region #5: ROM region for TM4C123GXL, whole 256K
    MPU->RBAR = 0x00000000U + 0x15U;        // base address + region #5
    MPU->RASR = ((18U - 1U) << MPU_RASR_SIZE_Pos)     // 2^18=256K size
       + (6U << MPU_RASR_AP_Pos)                      // PA:ro/UA:ro
       + (0U << MPU_RASR_XN_Pos)                      // XN=0
       + (0U << MPU_RASR_S_Pos)                       // S=0
       + (1U << MPU_RASR_C_Pos)                       // C=1
       + (0U << MPU_RASR_B_Pos)                       // B=0
       + (0U << MPU_RASR_TEX_Pos)                     // TEX=0
       + MPU_RASR_ENABLE_Msk;                         // region enable

